bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
/**
  ******************************************************************************
  * @file    usb_reg.h
  * @version V1.2
  * @date    2020-09-04
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __USB_REG_H__
#define __USB_REG_H__

#include "bl702l.h"

/* 0x0 : usb_config */
#define USB_CONFIG_OFFSET               (0x0)
#define USB_CR_USB_EN                   USB_CR_USB_EN
#define USB_CR_USB_EN_POS               (0U)
#define USB_CR_USB_EN_LEN               (1U)
#define USB_CR_USB_EN_MSK               (((1U << USB_CR_USB_EN_LEN) - 1) << USB_CR_USB_EN_POS)
#define USB_CR_USB_EN_UMSK              (~(((1U << USB_CR_USB_EN_LEN) - 1) << USB_CR_USB_EN_POS))
#define USB_CR_USB_ROM_DCT_EN           USB_CR_USB_ROM_DCT_EN
#define USB_CR_USB_ROM_DCT_EN_POS       (4U)
#define USB_CR_USB_ROM_DCT_EN_LEN       (1U)
#define USB_CR_USB_ROM_DCT_EN_MSK       (((1U << USB_CR_USB_ROM_DCT_EN_LEN) - 1) << USB_CR_USB_ROM_DCT_EN_POS)
#define USB_CR_USB_ROM_DCT_EN_UMSK      (~(((1U << USB_CR_USB_ROM_DCT_EN_LEN) - 1) << USB_CR_USB_ROM_DCT_EN_POS))
#define USB_CR_USB_EP0_SW_CTRL          USB_CR_USB_EP0_SW_CTRL
#define USB_CR_USB_EP0_SW_CTRL_POS      (8U)
#define USB_CR_USB_EP0_SW_CTRL_LEN      (1U)
#define USB_CR_USB_EP0_SW_CTRL_MSK      (((1U << USB_CR_USB_EP0_SW_CTRL_LEN) - 1) << USB_CR_USB_EP0_SW_CTRL_POS)
#define USB_CR_USB_EP0_SW_CTRL_UMSK     (~(((1U << USB_CR_USB_EP0_SW_CTRL_LEN) - 1) << USB_CR_USB_EP0_SW_CTRL_POS))
#define USB_CR_USB_EP0_SW_ADDR          USB_CR_USB_EP0_SW_ADDR
#define USB_CR_USB_EP0_SW_ADDR_POS      (9U)
#define USB_CR_USB_EP0_SW_ADDR_LEN      (7U)
#define USB_CR_USB_EP0_SW_ADDR_MSK      (((1U << USB_CR_USB_EP0_SW_ADDR_LEN) - 1) << USB_CR_USB_EP0_SW_ADDR_POS)
#define USB_CR_USB_EP0_SW_ADDR_UMSK     (~(((1U << USB_CR_USB_EP0_SW_ADDR_LEN) - 1) << USB_CR_USB_EP0_SW_ADDR_POS))
#define USB_CR_USB_EP0_SW_SIZE          USB_CR_USB_EP0_SW_SIZE
#define USB_CR_USB_EP0_SW_SIZE_POS      (16U)
#define USB_CR_USB_EP0_SW_SIZE_LEN      (8U)
#define USB_CR_USB_EP0_SW_SIZE_MSK      (((1U << USB_CR_USB_EP0_SW_SIZE_LEN) - 1) << USB_CR_USB_EP0_SW_SIZE_POS)
#define USB_CR_USB_EP0_SW_SIZE_UMSK     (~(((1U << USB_CR_USB_EP0_SW_SIZE_LEN) - 1) << USB_CR_USB_EP0_SW_SIZE_POS))
#define USB_CR_USB_EP0_SW_STALL         USB_CR_USB_EP0_SW_STALL
#define USB_CR_USB_EP0_SW_STALL_POS     (24U)
#define USB_CR_USB_EP0_SW_STALL_LEN     (1U)
#define USB_CR_USB_EP0_SW_STALL_MSK     (((1U << USB_CR_USB_EP0_SW_STALL_LEN) - 1) << USB_CR_USB_EP0_SW_STALL_POS)
#define USB_CR_USB_EP0_SW_STALL_UMSK    (~(((1U << USB_CR_USB_EP0_SW_STALL_LEN) - 1) << USB_CR_USB_EP0_SW_STALL_POS))
#define USB_CR_USB_EP0_SW_NACK_IN       USB_CR_USB_EP0_SW_NACK_IN
#define USB_CR_USB_EP0_SW_NACK_IN_POS   (25U)
#define USB_CR_USB_EP0_SW_NACK_IN_LEN   (1U)
#define USB_CR_USB_EP0_SW_NACK_IN_MSK   (((1U << USB_CR_USB_EP0_SW_NACK_IN_LEN) - 1) << USB_CR_USB_EP0_SW_NACK_IN_POS)
#define USB_CR_USB_EP0_SW_NACK_IN_UMSK  (~(((1U << USB_CR_USB_EP0_SW_NACK_IN_LEN) - 1) << USB_CR_USB_EP0_SW_NACK_IN_POS))
#define USB_CR_USB_EP0_SW_NACK_OUT      USB_CR_USB_EP0_SW_NACK_OUT
#define USB_CR_USB_EP0_SW_NACK_OUT_POS  (26U)
#define USB_CR_USB_EP0_SW_NACK_OUT_LEN  (1U)
#define USB_CR_USB_EP0_SW_NACK_OUT_MSK  (((1U << USB_CR_USB_EP0_SW_NACK_OUT_LEN) - 1) << USB_CR_USB_EP0_SW_NACK_OUT_POS)
#define USB_CR_USB_EP0_SW_NACK_OUT_UMSK (~(((1U << USB_CR_USB_EP0_SW_NACK_OUT_LEN) - 1) << USB_CR_USB_EP0_SW_NACK_OUT_POS))
#define USB_CR_USB_EP0_SW_RDY           USB_CR_USB_EP0_SW_RDY
#define USB_CR_USB_EP0_SW_RDY_POS       (27U)
#define USB_CR_USB_EP0_SW_RDY_LEN       (1U)
#define USB_CR_USB_EP0_SW_RDY_MSK       (((1U << USB_CR_USB_EP0_SW_RDY_LEN) - 1) << USB_CR_USB_EP0_SW_RDY_POS)
#define USB_CR_USB_EP0_SW_RDY_UMSK      (~(((1U << USB_CR_USB_EP0_SW_RDY_LEN) - 1) << USB_CR_USB_EP0_SW_RDY_POS))
#define USB_STS_USB_EP0_SW_RDY          USB_STS_USB_EP0_SW_RDY
#define USB_STS_USB_EP0_SW_RDY_POS      (28U)
#define USB_STS_USB_EP0_SW_RDY_LEN      (1U)
#define USB_STS_USB_EP0_SW_RDY_MSK      (((1U << USB_STS_USB_EP0_SW_RDY_LEN) - 1) << USB_STS_USB_EP0_SW_RDY_POS)
#define USB_STS_USB_EP0_SW_RDY_UMSK     (~(((1U << USB_STS_USB_EP0_SW_RDY_LEN) - 1) << USB_STS_USB_EP0_SW_RDY_POS))

/* 0x4 : usb_lpm_config */
#define USB_LPM_CONFIG_OFFSET    (0x4)
#define USB_CR_LPM_EN            USB_CR_LPM_EN
#define USB_CR_LPM_EN_POS        (0U)
#define USB_CR_LPM_EN_LEN        (1U)
#define USB_CR_LPM_EN_MSK        (((1U << USB_CR_LPM_EN_LEN) - 1) << USB_CR_LPM_EN_POS)
#define USB_CR_LPM_EN_UMSK       (~(((1U << USB_CR_LPM_EN_LEN) - 1) << USB_CR_LPM_EN_POS))
#define USB_CR_LPM_RESP_UPD      USB_CR_LPM_RESP_UPD
#define USB_CR_LPM_RESP_UPD_POS  (1U)
#define USB_CR_LPM_RESP_UPD_LEN  (1U)
#define USB_CR_LPM_RESP_UPD_MSK  (((1U << USB_CR_LPM_RESP_UPD_LEN) - 1) << USB_CR_LPM_RESP_UPD_POS)
#define USB_CR_LPM_RESP_UPD_UMSK (~(((1U << USB_CR_LPM_RESP_UPD_LEN) - 1) << USB_CR_LPM_RESP_UPD_POS))
#define USB_CR_LPM_RESP          USB_CR_LPM_RESP
#define USB_CR_LPM_RESP_POS      (2U)
#define USB_CR_LPM_RESP_LEN      (2U)
#define USB_CR_LPM_RESP_MSK      (((1U << USB_CR_LPM_RESP_LEN) - 1) << USB_CR_LPM_RESP_POS)
#define USB_CR_LPM_RESP_UMSK     (~(((1U << USB_CR_LPM_RESP_LEN) - 1) << USB_CR_LPM_RESP_POS))
#define USB_STS_LPM_ATTR         USB_STS_LPM_ATTR
#define USB_STS_LPM_ATTR_POS     (20U)
#define USB_STS_LPM_ATTR_LEN     (11U)
#define USB_STS_LPM_ATTR_MSK     (((1U << USB_STS_LPM_ATTR_LEN) - 1) << USB_STS_LPM_ATTR_POS)
#define USB_STS_LPM_ATTR_UMSK    (~(((1U << USB_STS_LPM_ATTR_LEN) - 1) << USB_STS_LPM_ATTR_POS))
#define USB_STS_LPM              USB_STS_LPM
#define USB_STS_LPM_POS          (31U)
#define USB_STS_LPM_LEN          (1U)
#define USB_STS_LPM_MSK          (((1U << USB_STS_LPM_LEN) - 1) << USB_STS_LPM_POS)
#define USB_STS_LPM_UMSK         (~(((1U << USB_STS_LPM_LEN) - 1) << USB_STS_LPM_POS))

/* 0x8 : usb_resume_config */
#define USB_RESUME_CONFIG_OFFSET (0x8)
#define USB_CR_RES_WIDTH         USB_CR_RES_WIDTH
#define USB_CR_RES_WIDTH_POS     (0U)
#define USB_CR_RES_WIDTH_LEN     (11U)
#define USB_CR_RES_WIDTH_MSK     (((1U << USB_CR_RES_WIDTH_LEN) - 1) << USB_CR_RES_WIDTH_POS)
#define USB_CR_RES_WIDTH_UMSK    (~(((1U << USB_CR_RES_WIDTH_LEN) - 1) << USB_CR_RES_WIDTH_POS))
#define USB_CR_RES_TRIG          USB_CR_RES_TRIG
#define USB_CR_RES_TRIG_POS      (12U)
#define USB_CR_RES_TRIG_LEN      (1U)
#define USB_CR_RES_TRIG_MSK      (((1U << USB_CR_RES_TRIG_LEN) - 1) << USB_CR_RES_TRIG_POS)
#define USB_CR_RES_TRIG_UMSK     (~(((1U << USB_CR_RES_TRIG_LEN) - 1) << USB_CR_RES_TRIG_POS))
#define USB_CR_RES_FORCE         USB_CR_RES_FORCE
#define USB_CR_RES_FORCE_POS     (31U)
#define USB_CR_RES_FORCE_LEN     (1U)
#define USB_CR_RES_FORCE_MSK     (((1U << USB_CR_RES_FORCE_LEN) - 1) << USB_CR_RES_FORCE_POS)
#define USB_CR_RES_FORCE_UMSK    (~(((1U << USB_CR_RES_FORCE_LEN) - 1) << USB_CR_RES_FORCE_POS))

