bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
/* 0x48 : ep3_config */
#define USB_EP3_CONFIG_OFFSET (0x48)
#define USB_CR_EP3_SIZE       USB_CR_EP3_SIZE
#define USB_CR_EP3_SIZE_POS   (0U)
#define USB_CR_EP3_SIZE_LEN   (11U)
#define USB_CR_EP3_SIZE_MSK   (((1U << USB_CR_EP3_SIZE_LEN) - 1) << USB_CR_EP3_SIZE_POS)
#define USB_CR_EP3_SIZE_UMSK  (~(((1U << USB_CR_EP3_SIZE_LEN) - 1) << USB_CR_EP3_SIZE_POS))
#define USB_CR_EP3_DIR        USB_CR_EP3_DIR
#define USB_CR_EP3_DIR_POS    (11U)
#define USB_CR_EP3_DIR_LEN    (2U)
#define USB_CR_EP3_DIR_MSK    (((1U << USB_CR_EP3_DIR_LEN) - 1) << USB_CR_EP3_DIR_POS)
#define USB_CR_EP3_DIR_UMSK   (~(((1U << USB_CR_EP3_DIR_LEN) - 1) << USB_CR_EP3_DIR_POS))
#define USB_CR_EP3_TYPE       USB_CR_EP3_TYPE
#define USB_CR_EP3_TYPE_POS   (13U)
#define USB_CR_EP3_TYPE_LEN   (3U)
#define USB_CR_EP3_TYPE_MSK   (((1U << USB_CR_EP3_TYPE_LEN) - 1) << USB_CR_EP3_TYPE_POS)
#define USB_CR_EP3_TYPE_UMSK  (~(((1U << USB_CR_EP3_TYPE_LEN) - 1) << USB_CR_EP3_TYPE_POS))
#define USB_CR_EP3_STALL      USB_CR_EP3_STALL
#define USB_CR_EP3_STALL_POS  (16U)
#define USB_CR_EP3_STALL_LEN  (1U)
#define USB_CR_EP3_STALL_MSK  (((1U << USB_CR_EP3_STALL_LEN) - 1) << USB_CR_EP3_STALL_POS)
#define USB_CR_EP3_STALL_UMSK (~(((1U << USB_CR_EP3_STALL_LEN) - 1) << USB_CR_EP3_STALL_POS))
#define USB_CR_EP3_NACK       USB_CR_EP3_NACK
#define USB_CR_EP3_NACK_POS   (17U)
#define USB_CR_EP3_NACK_LEN   (1U)
#define USB_CR_EP3_NACK_MSK   (((1U << USB_CR_EP3_NACK_LEN) - 1) << USB_CR_EP3_NACK_POS)
#define USB_CR_EP3_NACK_UMSK  (~(((1U << USB_CR_EP3_NACK_LEN) - 1) << USB_CR_EP3_NACK_POS))
#define USB_CR_EP3_RDY        USB_CR_EP3_RDY
#define USB_CR_EP3_RDY_POS    (18U)
#define USB_CR_EP3_RDY_LEN    (1U)
#define USB_CR_EP3_RDY_MSK    (((1U << USB_CR_EP3_RDY_LEN) - 1) << USB_CR_EP3_RDY_POS)
#define USB_CR_EP3_RDY_UMSK   (~(((1U << USB_CR_EP3_RDY_LEN) - 1) << USB_CR_EP3_RDY_POS))
#define USB_STS_EP3_RDY       USB_STS_EP3_RDY
#define USB_STS_EP3_RDY_POS   (19U)
#define USB_STS_EP3_RDY_LEN   (1U)
#define USB_STS_EP3_RDY_MSK   (((1U << USB_STS_EP3_RDY_LEN) - 1) << USB_STS_EP3_RDY_POS)
#define USB_STS_EP3_RDY_UMSK  (~(((1U << USB_STS_EP3_RDY_LEN) - 1) << USB_STS_EP3_RDY_POS))

/* 0x4C : ep4_config */
#define USB_EP4_CONFIG_OFFSET (0x4C)
#define USB_CR_EP4_SIZE       USB_CR_EP4_SIZE
#define USB_CR_EP4_SIZE_POS   (0U)
#define USB_CR_EP4_SIZE_LEN   (11U)
#define USB_CR_EP4_SIZE_MSK   (((1U << USB_CR_EP4_SIZE_LEN) - 1) << USB_CR_EP4_SIZE_POS)
#define USB_CR_EP4_SIZE_UMSK  (~(((1U << USB_CR_EP4_SIZE_LEN) - 1) << USB_CR_EP4_SIZE_POS))
#define USB_CR_EP4_DIR        USB_CR_EP4_DIR
#define USB_CR_EP4_DIR_POS    (11U)
#define USB_CR_EP4_DIR_LEN    (2U)
#define USB_CR_EP4_DIR_MSK    (((1U << USB_CR_EP4_DIR_LEN) - 1) << USB_CR_EP4_DIR_POS)
#define USB_CR_EP4_DIR_UMSK   (~(((1U << USB_CR_EP4_DIR_LEN) - 1) << USB_CR_EP4_DIR_POS))
#define USB_CR_EP4_TYPE       USB_CR_EP4_TYPE
#define USB_CR_EP4_TYPE_POS   (13U)
#define USB_CR_EP4_TYPE_LEN   (3U)
#define USB_CR_EP4_TYPE_MSK   (((1U << USB_CR_EP4_TYPE_LEN) - 1) << USB_CR_EP4_TYPE_POS)
#define USB_CR_EP4_TYPE_UMSK  (~(((1U << USB_CR_EP4_TYPE_LEN) - 1) << USB_CR_EP4_TYPE_POS))
#define USB_CR_EP4_STALL      USB_CR_EP4_STALL
#define USB_CR_EP4_STALL_POS  (16U)
#define USB_CR_EP4_STALL_LEN  (1U)
#define USB_CR_EP4_STALL_MSK  (((1U << USB_CR_EP4_STALL_LEN) - 1) << USB_CR_EP4_STALL_POS)
#define USB_CR_EP4_STALL_UMSK (~(((1U << USB_CR_EP4_STALL_LEN) - 1) << USB_CR_EP4_STALL_POS))
#define USB_CR_EP4_NACK       USB_CR_EP4_NACK
#define USB_CR_EP4_NACK_POS   (17U)
#define USB_CR_EP4_NACK_LEN   (1U)
#define USB_CR_EP4_NACK_MSK   (((1U << USB_CR_EP4_NACK_LEN) - 1) << USB_CR_EP4_NACK_POS)
#define USB_CR_EP4_NACK_UMSK  (~(((1U << USB_CR_EP4_NACK_LEN) - 1) << USB_CR_EP4_NACK_POS))
#define USB_CR_EP4_RDY        USB_CR_EP4_RDY
#define USB_CR_EP4_RDY_POS    (18U)
#define USB_CR_EP4_RDY_LEN    (1U)
#define USB_CR_EP4_RDY_MSK    (((1U << USB_CR_EP4_RDY_LEN) - 1) << USB_CR_EP4_RDY_POS)
#define USB_CR_EP4_RDY_UMSK   (~(((1U << USB_CR_EP4_RDY_LEN) - 1) << USB_CR_EP4_RDY_POS))
#define USB_STS_EP4_RDY       USB_STS_EP4_RDY
#define USB_STS_EP4_RDY_POS   (19U)
#define USB_STS_EP4_RDY_LEN   (1U)
#define USB_STS_EP4_RDY_MSK   (((1U << USB_STS_EP4_RDY_LEN) - 1) << USB_STS_EP4_RDY_POS)
#define USB_STS_EP4_RDY_UMSK  (~(((1U << USB_STS_EP4_RDY_LEN) - 1) << USB_STS_EP4_RDY_POS))

/* 0x50 : ep5_config */
#define USB_EP5_CONFIG_OFFSET (0x50)
#define USB_CR_EP5_SIZE       USB_CR_EP5_SIZE
#define USB_CR_EP5_SIZE_POS   (0U)
#define USB_CR_EP5_SIZE_LEN   (11U)
#define USB_CR_EP5_SIZE_MSK   (((1U << USB_CR_EP5_SIZE_LEN) - 1) << USB_CR_EP5_SIZE_POS)
#define USB_CR_EP5_SIZE_UMSK  (~(((1U << USB_CR_EP5_SIZE_LEN) - 1) << USB_CR_EP5_SIZE_POS))
#define USB_CR_EP5_DIR        USB_CR_EP5_DIR
#define USB_CR_EP5_DIR_POS    (11U)
#define USB_CR_EP5_DIR_LEN    (2U)
#define USB_CR_EP5_DIR_MSK    (((1U << USB_CR_EP5_DIR_LEN) - 1) << USB_CR_EP5_DIR_POS)
#define USB_CR_EP5_DIR_UMSK   (~(((1U << USB_CR_EP5_DIR_LEN) - 1) << USB_CR_EP5_DIR_POS))
#define USB_CR_EP5_TYPE       USB_CR_EP5_TYPE
#define USB_CR_EP5_TYPE_POS   (13U)
#define USB_CR_EP5_TYPE_LEN   (3U)
#define USB_CR_EP5_TYPE_MSK   (((1U << USB_CR_EP5_TYPE_LEN) - 1) << USB_CR_EP5_TYPE_POS)
#define USB_CR_EP5_TYPE_UMSK  (~(((1U << USB_CR_EP5_TYPE_LEN) - 1) << USB_CR_EP5_TYPE_POS))
#define USB_CR_EP5_STALL      USB_CR_EP5_STALL
#define USB_CR_EP5_STALL_POS  (16U)
#define USB_CR_EP5_STALL_LEN  (1U)
#define USB_CR_EP5_STALL_MSK  (((1U << USB_CR_EP5_STALL_LEN) - 1) << USB_CR_EP5_STALL_POS)
#define USB_CR_EP5_STALL_UMSK (~(((1U << USB_CR_EP5_STALL_LEN) - 1) << USB_CR_EP5_STALL_POS))
#define USB_CR_EP5_NACK       USB_CR_EP5_NACK
#define USB_CR_EP5_NACK_POS   (17U)
#define USB_CR_EP5_NACK_LEN   (1U)
#define USB_CR_EP5_NACK_MSK   (((1U << USB_CR_EP5_NACK_LEN) - 1) << USB_CR_EP5_NACK_POS)
#define USB_CR_EP5_NACK_UMSK  (~(((1U << USB_CR_EP5_NACK_LEN) - 1) << USB_CR_EP5_NACK_POS))
#define USB_CR_EP5_RDY        USB_CR_EP5_RDY
#define USB_CR_EP5_RDY_POS    (18U)
#define USB_CR_EP5_RDY_LEN    (1U)
#define USB_CR_EP5_RDY_MSK    (((1U << USB_CR_EP5_RDY_LEN) - 1) << USB_CR_EP5_RDY_POS)
#define USB_CR_EP5_RDY_UMSK   (~(((1U << USB_CR_EP5_RDY_LEN) - 1) << USB_CR_EP5_RDY_POS))
#define USB_STS_EP5_RDY       USB_STS_EP5_RDY
#define USB_STS_EP5_RDY_POS   (19U)
#define USB_STS_EP5_RDY_LEN   (1U)
#define USB_STS_EP5_RDY_MSK   (((1U << USB_STS_EP5_RDY_LEN) - 1) << USB_STS_EP5_RDY_POS)
#define USB_STS_EP5_RDY_UMSK  (~(((1U << USB_STS_EP5_RDY_LEN) - 1) << USB_STS_EP5_RDY_POS))

/* 0x54 : ep6_config */
#define USB_EP6_CONFIG_OFFSET (0x54)
#define USB_CR_EP6_SIZE       USB_CR_EP6_SIZE
#define USB_CR_EP6_SIZE_POS   (0U)
#define USB_CR_EP6_SIZE_LEN   (11U)
#define USB_CR_EP6_SIZE_MSK   (((1U << USB_CR_EP6_SIZE_LEN) - 1) << USB_CR_EP6_SIZE_POS)
#define USB_CR_EP6_SIZE_UMSK  (~(((1U << USB_CR_EP6_SIZE_LEN) - 1) << USB_CR_EP6_SIZE_POS))
#define USB_CR_EP6_DIR        USB_CR_EP6_DIR
#define USB_CR_EP6_DIR_POS    (11U)
#define USB_CR_EP6_DIR_LEN    (2U)
#define USB_CR_EP6_DIR_MSK    (((1U << USB_CR_EP6_DIR_LEN) - 1) << USB_CR_EP6_DIR_POS)
#define USB_CR_EP6_DIR_UMSK   (~(((1U << USB_CR_EP6_DIR_LEN) - 1) << USB_CR_EP6_DIR_POS))
#define USB_CR_EP6_TYPE       USB_CR_EP6_TYPE
#define USB_CR_EP6_TYPE_POS   (13U)
#define USB_CR_EP6_TYPE_LEN   (3U)
#define USB_CR_EP6_TYPE_MSK   (((1U << USB_CR_EP6_TYPE_LEN) - 1) << USB_CR_EP6_TYPE_POS)
#define USB_CR_EP6_TYPE_UMSK  (~(((1U << USB_CR_EP6_TYPE_LEN) - 1) << USB_CR_EP6_TYPE_POS))
#define USB_CR_EP6_STALL      USB_CR_EP6_STALL
#define USB_CR_EP6_STALL_POS  (16U)
#define USB_CR_EP6_STALL_LEN  (1U)
#define USB_CR_EP6_STALL_MSK  (((1U << USB_CR_EP6_STALL_LEN) - 1) << USB_CR_EP6_STALL_POS)
#define USB_CR_EP6_STALL_UMSK (~(((1U << USB_CR_EP6_STALL_LEN) - 1) << USB_CR_EP6_STALL_POS))
#define USB_CR_EP6_NACK       USB_CR_EP6_NACK
#define USB_CR_EP6_NACK_POS   (17U)
#define USB_CR_EP6_NACK_LEN   (1U)
#define USB_CR_EP6_NACK_MSK   (((1U << USB_CR_EP6_NACK_LEN) - 1) << USB_CR_EP6_NACK_POS)
#define USB_CR_EP6_NACK_UMSK  (~(((1U << USB_CR_EP6_NACK_LEN) - 1) << USB_CR_EP6_NACK_POS))
#define USB_CR_EP6_RDY        USB_CR_EP6_RDY
#define USB_CR_EP6_RDY_POS    (18U)
#define USB_CR_EP6_RDY_LEN    (1U)
#define USB_CR_EP6_RDY_MSK    (((1U << USB_CR_EP6_RDY_LEN) - 1) << USB_CR_EP6_RDY_POS)
#define USB_CR_EP6_RDY_UMSK   (~(((1U << USB_CR_EP6_RDY_LEN) - 1) << USB_CR_EP6_RDY_POS))
#define USB_STS_EP6_RDY       USB_STS_EP6_RDY
#define USB_STS_EP6_RDY_POS   (19U)
#define USB_STS_EP6_RDY_LEN   (1U)
#define USB_STS_EP6_RDY_MSK   (((1U << USB_STS_EP6_RDY_LEN) - 1) << USB_STS_EP6_RDY_POS)
#define USB_STS_EP6_RDY_UMSK  (~(((1U << USB_STS_EP6_RDY_LEN) - 1) << USB_STS_EP6_RDY_POS))

/* 0x58 : ep7_config */
#define USB_EP7_CONFIG_OFFSET (0x58)
#define USB_CR_EP7_SIZE       USB_CR_EP7_SIZE
#define USB_CR_EP7_SIZE_POS   (0U)
#define USB_CR_EP7_SIZE_LEN   (11U)
#define USB_CR_EP7_SIZE_MSK   (((1U << USB_CR_EP7_SIZE_LEN) - 1) << USB_CR_EP7_SIZE_POS)
#define USB_CR_EP7_SIZE_UMSK  (~(((1U << USB_CR_EP7_SIZE_LEN) - 1) << USB_CR_EP7_SIZE_POS))
#define USB_CR_EP7_DIR        USB_CR_EP7_DIR
#define USB_CR_EP7_DIR_POS    (11U)
#define USB_CR_EP7_DIR_LEN    (2U)
#define USB_CR_EP7_DIR_MSK    (((1U << USB_CR_EP7_DIR_LEN) - 1) << USB_CR_EP7_DIR_POS)
#define USB_CR_EP7_DIR_UMSK   (~(((1U << USB_CR_EP7_DIR_LEN) - 1) << USB_CR_EP7_DIR_POS))
#define USB_CR_EP7_TYPE       USB_CR_EP7_TYPE
#define USB_CR_EP7_TYPE_POS   (13U)
#define USB_CR_EP7_TYPE_LEN   (3U)
#define USB_CR_EP7_TYPE_MSK   (((1U << USB_CR_EP7_TYPE_LEN) - 1) << USB_CR_EP7_TYPE_POS)
#define USB_CR_EP7_TYPE_UMSK  (~(((1U << USB_CR_EP7_TYPE_LEN) - 1) << USB_CR_EP7_TYPE_POS))
#define USB_CR_EP7_STALL      USB_CR_EP7_STALL
#define USB_CR_EP7_STALL_POS  (16U)
#define USB_CR_EP7_STALL_LEN  (1U)
#define USB_CR_EP7_STALL_MSK  (((1U << USB_CR_EP7_STALL_LEN) - 1) << USB_CR_EP7_STALL_POS)
#define USB_CR_EP7_STALL_UMSK (~(((1U << USB_CR_EP7_STALL_LEN) - 1) << USB_CR_EP7_STALL_POS))
#define USB_CR_EP7_NACK       USB_CR_EP7_NACK
#define USB_CR_EP7_NACK_POS   (17U)
#define USB_CR_EP7_NACK_LEN   (1U)
#define USB_CR_EP7_NACK_MSK   (((1U << USB_CR_EP7_NACK_LEN) - 1) << USB_CR_EP7_NACK_POS)
#define USB_CR_EP7_NACK_UMSK  (~(((1U << USB_CR_EP7_NACK_LEN) - 1) << USB_CR_EP7_NACK_POS))
#define USB_CR_EP7_RDY        USB_CR_EP7_RDY
#define USB_CR_EP7_RDY_POS    (18U)
#define USB_CR_EP7_RDY_LEN    (1U)
#define USB_CR_EP7_RDY_MSK    (((1U << USB_CR_EP7_RDY_LEN) - 1) << USB_CR_EP7_RDY_POS)
#define USB_CR_EP7_RDY_UMSK   (~(((1U << USB_CR_EP7_RDY_LEN) - 1) << USB_CR_EP7_RDY_POS))
#define USB_STS_EP7_RDY       USB_STS_EP7_RDY
#define USB_STS_EP7_RDY_POS   (19U)
#define USB_STS_EP7_RDY_LEN   (1U)
#define USB_STS_EP7_RDY_MSK   (((1U << USB_STS_EP7_RDY_LEN) - 1) << USB_STS_EP7_RDY_POS)
#define USB_STS_EP7_RDY_UMSK  (~(((1U << USB_STS_EP7_RDY_LEN) - 1) << USB_STS_EP7_RDY_POS))

/* 0x100 : ep0_fifo_config */
#define USB_EP0_FIFO_CONFIG_OFFSET     (0x100)
#define USB_EP0_DMA_TX_EN              USB_EP0_DMA_TX_EN
#define USB_EP0_DMA_TX_EN_POS          (0U)
#define USB_EP0_DMA_TX_EN_LEN          (1U)
#define USB_EP0_DMA_TX_EN_MSK          (((1U << USB_EP0_DMA_TX_EN_LEN) - 1) << USB_EP0_DMA_TX_EN_POS)
#define USB_EP0_DMA_TX_EN_UMSK         (~(((1U << USB_EP0_DMA_TX_EN_LEN) - 1) << USB_EP0_DMA_TX_EN_POS))
#define USB_EP0_DMA_RX_EN              USB_EP0_DMA_RX_EN
#define USB_EP0_DMA_RX_EN_POS          (1U)
#define USB_EP0_DMA_RX_EN_LEN          (1U)
#define USB_EP0_DMA_RX_EN_MSK          (((1U << USB_EP0_DMA_RX_EN_LEN) - 1) << USB_EP0_DMA_RX_EN_POS)
#define USB_EP0_DMA_RX_EN_UMSK         (~(((1U << USB_EP0_DMA_RX_EN_LEN) - 1) << USB_EP0_DMA_RX_EN_POS))
#define USB_EP0_TX_FIFO_CLR            USB_EP0_TX_FIFO_CLR
#define USB_EP0_TX_FIFO_CLR_POS        (2U)
#define USB_EP0_TX_FIFO_CLR_LEN        (1U)
#define USB_EP0_TX_FIFO_CLR_MSK        (((1U << USB_EP0_TX_FIFO_CLR_LEN) - 1) << USB_EP0_TX_FIFO_CLR_POS)
#define USB_EP0_TX_FIFO_CLR_UMSK       (~(((1U << USB_EP0_TX_FIFO_CLR_LEN) - 1) << USB_EP0_TX_FIFO_CLR_POS))
#define USB_EP0_RX_FIFO_CLR            USB_EP0_RX_FIFO_CLR
#define USB_EP0_RX_FIFO_CLR_POS        (3U)
#define USB_EP0_RX_FIFO_CLR_LEN        (1U)
#define USB_EP0_RX_FIFO_CLR_MSK        (((1U << USB_EP0_RX_FIFO_CLR_LEN) - 1) << USB_EP0_RX_FIFO_CLR_POS)
#define USB_EP0_RX_FIFO_CLR_UMSK       (~(((1U << USB_EP0_RX_FIFO_CLR_LEN) - 1) << USB_EP0_RX_FIFO_CLR_POS))
#define USB_EP0_TX_FIFO_OVERFLOW       USB_EP0_TX_FIFO_OVERFLOW
#define USB_EP0_TX_FIFO_OVERFLOW_POS   (4U)
#define USB_EP0_TX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP0_TX_FIFO_OVERFLOW_MSK   (((1U << USB_EP0_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP0_TX_FIFO_OVERFLOW_POS)
#define USB_EP0_TX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP0_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP0_TX_FIFO_OVERFLOW_POS))
#define USB_EP0_TX_FIFO_UNDERFLOW      USB_EP0_TX_FIFO_UNDERFLOW
#define USB_EP0_TX_FIFO_UNDERFLOW_POS  (5U)
#define USB_EP0_TX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP0_TX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP0_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP0_TX_FIFO_UNDERFLOW_POS)
#define USB_EP0_TX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP0_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP0_TX_FIFO_UNDERFLOW_POS))
#define USB_EP0_RX_FIFO_OVERFLOW       USB_EP0_RX_FIFO_OVERFLOW
#define USB_EP0_RX_FIFO_OVERFLOW_POS   (6U)
#define USB_EP0_RX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP0_RX_FIFO_OVERFLOW_MSK   (((1U << USB_EP0_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP0_RX_FIFO_OVERFLOW_POS)
#define USB_EP0_RX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP0_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP0_RX_FIFO_OVERFLOW_POS))
#define USB_EP0_RX_FIFO_UNDERFLOW      USB_EP0_RX_FIFO_UNDERFLOW
#define USB_EP0_RX_FIFO_UNDERFLOW_POS  (7U)
#define USB_EP0_RX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP0_RX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP0_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP0_RX_FIFO_UNDERFLOW_POS)
#define USB_EP0_RX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP0_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP0_RX_FIFO_UNDERFLOW_POS))

/* 0x104 : ep0_fifo_status */
#define USB_EP0_FIFO_STATUS_OFFSET (0x104)
#define USB_EP0_TX_FIFO_CNT        USB_EP0_TX_FIFO_CNT
#define USB_EP0_TX_FIFO_CNT_POS    (0U)
#define USB_EP0_TX_FIFO_CNT_LEN    (7U)
#define USB_EP0_TX_FIFO_CNT_MSK    (((1U << USB_EP0_TX_FIFO_CNT_LEN) - 1) << USB_EP0_TX_FIFO_CNT_POS)
#define USB_EP0_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP0_TX_FIFO_CNT_LEN) - 1) << USB_EP0_TX_FIFO_CNT_POS))
#define USB_EP0_TX_FIFO_EMPTY      USB_EP0_TX_FIFO_EMPTY
#define USB_EP0_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP0_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP0_TX_FIFO_EMPTY_MSK  (((1U << USB_EP0_TX_FIFO_EMPTY_LEN) - 1) << USB_EP0_TX_FIFO_EMPTY_POS)
#define USB_EP0_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP0_TX_FIFO_EMPTY_LEN) - 1) << USB_EP0_TX_FIFO_EMPTY_POS))
#define USB_EP0_TX_FIFO_FULL       USB_EP0_TX_FIFO_FULL
#define USB_EP0_TX_FIFO_FULL_POS   (15U)
#define USB_EP0_TX_FIFO_FULL_LEN   (1U)
#define USB_EP0_TX_FIFO_FULL_MSK   (((1U << USB_EP0_TX_FIFO_FULL_LEN) - 1) << USB_EP0_TX_FIFO_FULL_POS)
#define USB_EP0_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP0_TX_FIFO_FULL_LEN) - 1) << USB_EP0_TX_FIFO_FULL_POS))
#define USB_EP0_RX_FIFO_CNT        USB_EP0_RX_FIFO_CNT
#define USB_EP0_RX_FIFO_CNT_POS    (16U)
#define USB_EP0_RX_FIFO_CNT_LEN    (7U)
#define USB_EP0_RX_FIFO_CNT_MSK    (((1U << USB_EP0_RX_FIFO_CNT_LEN) - 1) << USB_EP0_RX_FIFO_CNT_POS)
#define USB_EP0_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP0_RX_FIFO_CNT_LEN) - 1) << USB_EP0_RX_FIFO_CNT_POS))
#define USB_EP0_RX_FIFO_EMPTY      USB_EP0_RX_FIFO_EMPTY
#define USB_EP0_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP0_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP0_RX_FIFO_EMPTY_MSK  (((1U << USB_EP0_RX_FIFO_EMPTY_LEN) - 1) << USB_EP0_RX_FIFO_EMPTY_POS)
#define USB_EP0_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP0_RX_FIFO_EMPTY_LEN) - 1) << USB_EP0_RX_FIFO_EMPTY_POS))
#define USB_EP0_RX_FIFO_FULL       USB_EP0_RX_FIFO_FULL
#define USB_EP0_RX_FIFO_FULL_POS   (31U)
#define USB_EP0_RX_FIFO_FULL_LEN   (1U)
#define USB_EP0_RX_FIFO_FULL_MSK   (((1U << USB_EP0_RX_FIFO_FULL_LEN) - 1) << USB_EP0_RX_FIFO_FULL_POS)
#define USB_EP0_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP0_RX_FIFO_FULL_LEN) - 1) << USB_EP0_RX_FIFO_FULL_POS))

/* 0x108 : ep0_tx_fifo_wdata */
#define USB_EP0_TX_FIFO_WDATA_OFFSET (0x108)
#define USB_EP0_TX_FIFO_WDATA        USB_EP0_TX_FIFO_WDATA
#define USB_EP0_TX_FIFO_WDATA_POS    (0U)
#define USB_EP0_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP0_TX_FIFO_WDATA_MSK    (((1U << USB_EP0_TX_FIFO_WDATA_LEN) - 1) << USB_EP0_TX_FIFO_WDATA_POS)
#define USB_EP0_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP0_TX_FIFO_WDATA_LEN) - 1) << USB_EP0_TX_FIFO_WDATA_POS))

/* 0x10C : ep0_rx_fifo_rdata */
#define USB_EP0_RX_FIFO_RDATA_OFFSET (0x10C)
#define USB_EP0_RX_FIFO_RDATA        USB_EP0_RX_FIFO_RDATA
#define USB_EP0_RX_FIFO_RDATA_POS    (0U)
#define USB_EP0_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP0_RX_FIFO_RDATA_MSK    (((1U << USB_EP0_RX_FIFO_RDATA_LEN) - 1) << USB_EP0_RX_FIFO_RDATA_POS)
#define USB_EP0_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP0_RX_FIFO_RDATA_LEN) - 1) << USB_EP0_RX_FIFO_RDATA_POS))

