bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
/* 0x110 : ep1_fifo_config */
#define USB_EP1_FIFO_CONFIG_OFFSET     (0x110)
#define USB_EP1_DMA_TX_EN              USB_EP1_DMA_TX_EN
#define USB_EP1_DMA_TX_EN_POS          (0U)
#define USB_EP1_DMA_TX_EN_LEN          (1U)
#define USB_EP1_DMA_TX_EN_MSK          (((1U << USB_EP1_DMA_TX_EN_LEN) - 1) << USB_EP1_DMA_TX_EN_POS)
#define USB_EP1_DMA_TX_EN_UMSK         (~(((1U << USB_EP1_DMA_TX_EN_LEN) - 1) << USB_EP1_DMA_TX_EN_POS))
#define USB_EP1_DMA_RX_EN              USB_EP1_DMA_RX_EN
#define USB_EP1_DMA_RX_EN_POS          (1U)
#define USB_EP1_DMA_RX_EN_LEN          (1U)
#define USB_EP1_DMA_RX_EN_MSK          (((1U << USB_EP1_DMA_RX_EN_LEN) - 1) << USB_EP1_DMA_RX_EN_POS)
#define USB_EP1_DMA_RX_EN_UMSK         (~(((1U << USB_EP1_DMA_RX_EN_LEN) - 1) << USB_EP1_DMA_RX_EN_POS))
#define USB_EP1_TX_FIFO_CLR            USB_EP1_TX_FIFO_CLR
#define USB_EP1_TX_FIFO_CLR_POS        (2U)
#define USB_EP1_TX_FIFO_CLR_LEN        (1U)
#define USB_EP1_TX_FIFO_CLR_MSK        (((1U << USB_EP1_TX_FIFO_CLR_LEN) - 1) << USB_EP1_TX_FIFO_CLR_POS)
#define USB_EP1_TX_FIFO_CLR_UMSK       (~(((1U << USB_EP1_TX_FIFO_CLR_LEN) - 1) << USB_EP1_TX_FIFO_CLR_POS))
#define USB_EP1_RX_FIFO_CLR            USB_EP1_RX_FIFO_CLR
#define USB_EP1_RX_FIFO_CLR_POS        (3U)
#define USB_EP1_RX_FIFO_CLR_LEN        (1U)
#define USB_EP1_RX_FIFO_CLR_MSK        (((1U << USB_EP1_RX_FIFO_CLR_LEN) - 1) << USB_EP1_RX_FIFO_CLR_POS)
#define USB_EP1_RX_FIFO_CLR_UMSK       (~(((1U << USB_EP1_RX_FIFO_CLR_LEN) - 1) << USB_EP1_RX_FIFO_CLR_POS))
#define USB_EP1_TX_FIFO_OVERFLOW       USB_EP1_TX_FIFO_OVERFLOW
#define USB_EP1_TX_FIFO_OVERFLOW_POS   (4U)
#define USB_EP1_TX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP1_TX_FIFO_OVERFLOW_MSK   (((1U << USB_EP1_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP1_TX_FIFO_OVERFLOW_POS)
#define USB_EP1_TX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP1_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP1_TX_FIFO_OVERFLOW_POS))
#define USB_EP1_TX_FIFO_UNDERFLOW      USB_EP1_TX_FIFO_UNDERFLOW
#define USB_EP1_TX_FIFO_UNDERFLOW_POS  (5U)
#define USB_EP1_TX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP1_TX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP1_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP1_TX_FIFO_UNDERFLOW_POS)
#define USB_EP1_TX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP1_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP1_TX_FIFO_UNDERFLOW_POS))
#define USB_EP1_RX_FIFO_OVERFLOW       USB_EP1_RX_FIFO_OVERFLOW
#define USB_EP1_RX_FIFO_OVERFLOW_POS   (6U)
#define USB_EP1_RX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP1_RX_FIFO_OVERFLOW_MSK   (((1U << USB_EP1_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP1_RX_FIFO_OVERFLOW_POS)
#define USB_EP1_RX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP1_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP1_RX_FIFO_OVERFLOW_POS))
#define USB_EP1_RX_FIFO_UNDERFLOW      USB_EP1_RX_FIFO_UNDERFLOW
#define USB_EP1_RX_FIFO_UNDERFLOW_POS  (7U)
#define USB_EP1_RX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP1_RX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP1_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP1_RX_FIFO_UNDERFLOW_POS)
#define USB_EP1_RX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP1_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP1_RX_FIFO_UNDERFLOW_POS))

/* 0x114 : ep1_fifo_status */
#define USB_EP1_FIFO_STATUS_OFFSET (0x114)
#define USB_EP1_TX_FIFO_CNT        USB_EP1_TX_FIFO_CNT
#define USB_EP1_TX_FIFO_CNT_POS    (0U)
#define USB_EP1_TX_FIFO_CNT_LEN    (7U)
#define USB_EP1_TX_FIFO_CNT_MSK    (((1U << USB_EP1_TX_FIFO_CNT_LEN) - 1) << USB_EP1_TX_FIFO_CNT_POS)
#define USB_EP1_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP1_TX_FIFO_CNT_LEN) - 1) << USB_EP1_TX_FIFO_CNT_POS))
#define USB_EP1_TX_FIFO_EMPTY      USB_EP1_TX_FIFO_EMPTY
#define USB_EP1_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP1_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP1_TX_FIFO_EMPTY_MSK  (((1U << USB_EP1_TX_FIFO_EMPTY_LEN) - 1) << USB_EP1_TX_FIFO_EMPTY_POS)
#define USB_EP1_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP1_TX_FIFO_EMPTY_LEN) - 1) << USB_EP1_TX_FIFO_EMPTY_POS))
#define USB_EP1_TX_FIFO_FULL       USB_EP1_TX_FIFO_FULL
#define USB_EP1_TX_FIFO_FULL_POS   (15U)
#define USB_EP1_TX_FIFO_FULL_LEN   (1U)
#define USB_EP1_TX_FIFO_FULL_MSK   (((1U << USB_EP1_TX_FIFO_FULL_LEN) - 1) << USB_EP1_TX_FIFO_FULL_POS)
#define USB_EP1_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP1_TX_FIFO_FULL_LEN) - 1) << USB_EP1_TX_FIFO_FULL_POS))
#define USB_EP1_RX_FIFO_CNT        USB_EP1_RX_FIFO_CNT
#define USB_EP1_RX_FIFO_CNT_POS    (16U)
#define USB_EP1_RX_FIFO_CNT_LEN    (7U)
#define USB_EP1_RX_FIFO_CNT_MSK    (((1U << USB_EP1_RX_FIFO_CNT_LEN) - 1) << USB_EP1_RX_FIFO_CNT_POS)
#define USB_EP1_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP1_RX_FIFO_CNT_LEN) - 1) << USB_EP1_RX_FIFO_CNT_POS))
#define USB_EP1_RX_FIFO_EMPTY      USB_EP1_RX_FIFO_EMPTY
#define USB_EP1_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP1_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP1_RX_FIFO_EMPTY_MSK  (((1U << USB_EP1_RX_FIFO_EMPTY_LEN) - 1) << USB_EP1_RX_FIFO_EMPTY_POS)
#define USB_EP1_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP1_RX_FIFO_EMPTY_LEN) - 1) << USB_EP1_RX_FIFO_EMPTY_POS))
#define USB_EP1_RX_FIFO_FULL       USB_EP1_RX_FIFO_FULL
#define USB_EP1_RX_FIFO_FULL_POS   (31U)
#define USB_EP1_RX_FIFO_FULL_LEN   (1U)
#define USB_EP1_RX_FIFO_FULL_MSK   (((1U << USB_EP1_RX_FIFO_FULL_LEN) - 1) << USB_EP1_RX_FIFO_FULL_POS)
#define USB_EP1_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP1_RX_FIFO_FULL_LEN) - 1) << USB_EP1_RX_FIFO_FULL_POS))

/* 0x118 : ep1_tx_fifo_wdata */
#define USB_EP1_TX_FIFO_WDATA_OFFSET (0x118)
#define USB_EP1_TX_FIFO_WDATA        USB_EP1_TX_FIFO_WDATA
#define USB_EP1_TX_FIFO_WDATA_POS    (0U)
#define USB_EP1_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP1_TX_FIFO_WDATA_MSK    (((1U << USB_EP1_TX_FIFO_WDATA_LEN) - 1) << USB_EP1_TX_FIFO_WDATA_POS)
#define USB_EP1_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP1_TX_FIFO_WDATA_LEN) - 1) << USB_EP1_TX_FIFO_WDATA_POS))

/* 0x11C : ep1_rx_fifo_rdata */
#define USB_EP1_RX_FIFO_RDATA_OFFSET (0x11C)
#define USB_EP1_RX_FIFO_RDATA        USB_EP1_RX_FIFO_RDATA
#define USB_EP1_RX_FIFO_RDATA_POS    (0U)
#define USB_EP1_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP1_RX_FIFO_RDATA_MSK    (((1U << USB_EP1_RX_FIFO_RDATA_LEN) - 1) << USB_EP1_RX_FIFO_RDATA_POS)
#define USB_EP1_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP1_RX_FIFO_RDATA_LEN) - 1) << USB_EP1_RX_FIFO_RDATA_POS))

/* 0x120 : ep2_fifo_config */
#define USB_EP2_FIFO_CONFIG_OFFSET     (0x120)
#define USB_EP2_DMA_TX_EN              USB_EP2_DMA_TX_EN
#define USB_EP2_DMA_TX_EN_POS          (0U)
#define USB_EP2_DMA_TX_EN_LEN          (1U)
#define USB_EP2_DMA_TX_EN_MSK          (((1U << USB_EP2_DMA_TX_EN_LEN) - 1) << USB_EP2_DMA_TX_EN_POS)
#define USB_EP2_DMA_TX_EN_UMSK         (~(((1U << USB_EP2_DMA_TX_EN_LEN) - 1) << USB_EP2_DMA_TX_EN_POS))
#define USB_EP2_DMA_RX_EN              USB_EP2_DMA_RX_EN
#define USB_EP2_DMA_RX_EN_POS          (1U)
#define USB_EP2_DMA_RX_EN_LEN          (1U)
#define USB_EP2_DMA_RX_EN_MSK          (((1U << USB_EP2_DMA_RX_EN_LEN) - 1) << USB_EP2_DMA_RX_EN_POS)
#define USB_EP2_DMA_RX_EN_UMSK         (~(((1U << USB_EP2_DMA_RX_EN_LEN) - 1) << USB_EP2_DMA_RX_EN_POS))
#define USB_EP2_TX_FIFO_CLR            USB_EP2_TX_FIFO_CLR
#define USB_EP2_TX_FIFO_CLR_POS        (2U)
#define USB_EP2_TX_FIFO_CLR_LEN        (1U)
#define USB_EP2_TX_FIFO_CLR_MSK        (((1U << USB_EP2_TX_FIFO_CLR_LEN) - 1) << USB_EP2_TX_FIFO_CLR_POS)
#define USB_EP2_TX_FIFO_CLR_UMSK       (~(((1U << USB_EP2_TX_FIFO_CLR_LEN) - 1) << USB_EP2_TX_FIFO_CLR_POS))
#define USB_EP2_RX_FIFO_CLR            USB_EP2_RX_FIFO_CLR
#define USB_EP2_RX_FIFO_CLR_POS        (3U)
#define USB_EP2_RX_FIFO_CLR_LEN        (1U)
#define USB_EP2_RX_FIFO_CLR_MSK        (((1U << USB_EP2_RX_FIFO_CLR_LEN) - 1) << USB_EP2_RX_FIFO_CLR_POS)
#define USB_EP2_RX_FIFO_CLR_UMSK       (~(((1U << USB_EP2_RX_FIFO_CLR_LEN) - 1) << USB_EP2_RX_FIFO_CLR_POS))
#define USB_EP2_TX_FIFO_OVERFLOW       USB_EP2_TX_FIFO_OVERFLOW
#define USB_EP2_TX_FIFO_OVERFLOW_POS   (4U)
#define USB_EP2_TX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP2_TX_FIFO_OVERFLOW_MSK   (((1U << USB_EP2_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP2_TX_FIFO_OVERFLOW_POS)
#define USB_EP2_TX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP2_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP2_TX_FIFO_OVERFLOW_POS))
#define USB_EP2_TX_FIFO_UNDERFLOW      USB_EP2_TX_FIFO_UNDERFLOW
#define USB_EP2_TX_FIFO_UNDERFLOW_POS  (5U)
#define USB_EP2_TX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP2_TX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP2_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP2_TX_FIFO_UNDERFLOW_POS)
#define USB_EP2_TX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP2_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP2_TX_FIFO_UNDERFLOW_POS))
#define USB_EP2_RX_FIFO_OVERFLOW       USB_EP2_RX_FIFO_OVERFLOW
#define USB_EP2_RX_FIFO_OVERFLOW_POS   (6U)
#define USB_EP2_RX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP2_RX_FIFO_OVERFLOW_MSK   (((1U << USB_EP2_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP2_RX_FIFO_OVERFLOW_POS)
#define USB_EP2_RX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP2_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP2_RX_FIFO_OVERFLOW_POS))
#define USB_EP2_RX_FIFO_UNDERFLOW      USB_EP2_RX_FIFO_UNDERFLOW
#define USB_EP2_RX_FIFO_UNDERFLOW_POS  (7U)
#define USB_EP2_RX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP2_RX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP2_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP2_RX_FIFO_UNDERFLOW_POS)
#define USB_EP2_RX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP2_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP2_RX_FIFO_UNDERFLOW_POS))

/* 0x124 : ep2_fifo_status */
#define USB_EP2_FIFO_STATUS_OFFSET (0x124)
#define USB_EP2_TX_FIFO_CNT        USB_EP2_TX_FIFO_CNT
#define USB_EP2_TX_FIFO_CNT_POS    (0U)
#define USB_EP2_TX_FIFO_CNT_LEN    (7U)
#define USB_EP2_TX_FIFO_CNT_MSK    (((1U << USB_EP2_TX_FIFO_CNT_LEN) - 1) << USB_EP2_TX_FIFO_CNT_POS)
#define USB_EP2_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP2_TX_FIFO_CNT_LEN) - 1) << USB_EP2_TX_FIFO_CNT_POS))
#define USB_EP2_TX_FIFO_EMPTY      USB_EP2_TX_FIFO_EMPTY
#define USB_EP2_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP2_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP2_TX_FIFO_EMPTY_MSK  (((1U << USB_EP2_TX_FIFO_EMPTY_LEN) - 1) << USB_EP2_TX_FIFO_EMPTY_POS)
#define USB_EP2_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP2_TX_FIFO_EMPTY_LEN) - 1) << USB_EP2_TX_FIFO_EMPTY_POS))
#define USB_EP2_TX_FIFO_FULL       USB_EP2_TX_FIFO_FULL
#define USB_EP2_TX_FIFO_FULL_POS   (15U)
#define USB_EP2_TX_FIFO_FULL_LEN   (1U)
#define USB_EP2_TX_FIFO_FULL_MSK   (((1U << USB_EP2_TX_FIFO_FULL_LEN) - 1) << USB_EP2_TX_FIFO_FULL_POS)
#define USB_EP2_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP2_TX_FIFO_FULL_LEN) - 1) << USB_EP2_TX_FIFO_FULL_POS))
#define USB_EP2_RX_FIFO_CNT        USB_EP2_RX_FIFO_CNT
#define USB_EP2_RX_FIFO_CNT_POS    (16U)
#define USB_EP2_RX_FIFO_CNT_LEN    (7U)
#define USB_EP2_RX_FIFO_CNT_MSK    (((1U << USB_EP2_RX_FIFO_CNT_LEN) - 1) << USB_EP2_RX_FIFO_CNT_POS)
#define USB_EP2_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP2_RX_FIFO_CNT_LEN) - 1) << USB_EP2_RX_FIFO_CNT_POS))
#define USB_EP2_RX_FIFO_EMPTY      USB_EP2_RX_FIFO_EMPTY
#define USB_EP2_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP2_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP2_RX_FIFO_EMPTY_MSK  (((1U << USB_EP2_RX_FIFO_EMPTY_LEN) - 1) << USB_EP2_RX_FIFO_EMPTY_POS)
#define USB_EP2_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP2_RX_FIFO_EMPTY_LEN) - 1) << USB_EP2_RX_FIFO_EMPTY_POS))
#define USB_EP2_RX_FIFO_FULL       USB_EP2_RX_FIFO_FULL
#define USB_EP2_RX_FIFO_FULL_POS   (31U)
#define USB_EP2_RX_FIFO_FULL_LEN   (1U)
#define USB_EP2_RX_FIFO_FULL_MSK   (((1U << USB_EP2_RX_FIFO_FULL_LEN) - 1) << USB_EP2_RX_FIFO_FULL_POS)
#define USB_EP2_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP2_RX_FIFO_FULL_LEN) - 1) << USB_EP2_RX_FIFO_FULL_POS))

