bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
/* 0x128 : ep2_tx_fifo_wdata */
#define USB_EP2_TX_FIFO_WDATA_OFFSET (0x128)
#define USB_EP2_TX_FIFO_WDATA        USB_EP2_TX_FIFO_WDATA
#define USB_EP2_TX_FIFO_WDATA_POS    (0U)
#define USB_EP2_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP2_TX_FIFO_WDATA_MSK    (((1U << USB_EP2_TX_FIFO_WDATA_LEN) - 1) << USB_EP2_TX_FIFO_WDATA_POS)
#define USB_EP2_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP2_TX_FIFO_WDATA_LEN) - 1) << USB_EP2_TX_FIFO_WDATA_POS))

/* 0x12C : ep2_rx_fifo_rdata */
#define USB_EP2_RX_FIFO_RDATA_OFFSET (0x12C)
#define USB_EP2_RX_FIFO_RDATA        USB_EP2_RX_FIFO_RDATA
#define USB_EP2_RX_FIFO_RDATA_POS    (0U)
#define USB_EP2_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP2_RX_FIFO_RDATA_MSK    (((1U << USB_EP2_RX_FIFO_RDATA_LEN) - 1) << USB_EP2_RX_FIFO_RDATA_POS)
#define USB_EP2_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP2_RX_FIFO_RDATA_LEN) - 1) << USB_EP2_RX_FIFO_RDATA_POS))

/* 0x130 : ep3_fifo_config */
#define USB_EP3_FIFO_CONFIG_OFFSET     (0x130)
#define USB_EP3_DMA_TX_EN              USB_EP3_DMA_TX_EN
#define USB_EP3_DMA_TX_EN_POS          (0U)
#define USB_EP3_DMA_TX_EN_LEN          (1U)
#define USB_EP3_DMA_TX_EN_MSK          (((1U << USB_EP3_DMA_TX_EN_LEN) - 1) << USB_EP3_DMA_TX_EN_POS)
#define USB_EP3_DMA_TX_EN_UMSK         (~(((1U << USB_EP3_DMA_TX_EN_LEN) - 1) << USB_EP3_DMA_TX_EN_POS))
#define USB_EP3_DMA_RX_EN              USB_EP3_DMA_RX_EN
#define USB_EP3_DMA_RX_EN_POS          (1U)
#define USB_EP3_DMA_RX_EN_LEN          (1U)
#define USB_EP3_DMA_RX_EN_MSK          (((1U << USB_EP3_DMA_RX_EN_LEN) - 1) << USB_EP3_DMA_RX_EN_POS)
#define USB_EP3_DMA_RX_EN_UMSK         (~(((1U << USB_EP3_DMA_RX_EN_LEN) - 1) << USB_EP3_DMA_RX_EN_POS))
#define USB_EP3_TX_FIFO_CLR            USB_EP3_TX_FIFO_CLR
#define USB_EP3_TX_FIFO_CLR_POS        (2U)
#define USB_EP3_TX_FIFO_CLR_LEN        (1U)
#define USB_EP3_TX_FIFO_CLR_MSK        (((1U << USB_EP3_TX_FIFO_CLR_LEN) - 1) << USB_EP3_TX_FIFO_CLR_POS)
#define USB_EP3_TX_FIFO_CLR_UMSK       (~(((1U << USB_EP3_TX_FIFO_CLR_LEN) - 1) << USB_EP3_TX_FIFO_CLR_POS))
#define USB_EP3_RX_FIFO_CLR            USB_EP3_RX_FIFO_CLR
#define USB_EP3_RX_FIFO_CLR_POS        (3U)
#define USB_EP3_RX_FIFO_CLR_LEN        (1U)
#define USB_EP3_RX_FIFO_CLR_MSK        (((1U << USB_EP3_RX_FIFO_CLR_LEN) - 1) << USB_EP3_RX_FIFO_CLR_POS)
#define USB_EP3_RX_FIFO_CLR_UMSK       (~(((1U << USB_EP3_RX_FIFO_CLR_LEN) - 1) << USB_EP3_RX_FIFO_CLR_POS))
#define USB_EP3_TX_FIFO_OVERFLOW       USB_EP3_TX_FIFO_OVERFLOW
#define USB_EP3_TX_FIFO_OVERFLOW_POS   (4U)
#define USB_EP3_TX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP3_TX_FIFO_OVERFLOW_MSK   (((1U << USB_EP3_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP3_TX_FIFO_OVERFLOW_POS)
#define USB_EP3_TX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP3_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP3_TX_FIFO_OVERFLOW_POS))
#define USB_EP3_TX_FIFO_UNDERFLOW      USB_EP3_TX_FIFO_UNDERFLOW
#define USB_EP3_TX_FIFO_UNDERFLOW_POS  (5U)
#define USB_EP3_TX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP3_TX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP3_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP3_TX_FIFO_UNDERFLOW_POS)
#define USB_EP3_TX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP3_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP3_TX_FIFO_UNDERFLOW_POS))
#define USB_EP3_RX_FIFO_OVERFLOW       USB_EP3_RX_FIFO_OVERFLOW
#define USB_EP3_RX_FIFO_OVERFLOW_POS   (6U)
#define USB_EP3_RX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP3_RX_FIFO_OVERFLOW_MSK   (((1U << USB_EP3_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP3_RX_FIFO_OVERFLOW_POS)
#define USB_EP3_RX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP3_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP3_RX_FIFO_OVERFLOW_POS))
#define USB_EP3_RX_FIFO_UNDERFLOW      USB_EP3_RX_FIFO_UNDERFLOW
#define USB_EP3_RX_FIFO_UNDERFLOW_POS  (7U)
#define USB_EP3_RX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP3_RX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP3_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP3_RX_FIFO_UNDERFLOW_POS)
#define USB_EP3_RX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP3_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP3_RX_FIFO_UNDERFLOW_POS))

/* 0x134 : ep3_fifo_status */
#define USB_EP3_FIFO_STATUS_OFFSET (0x134)
#define USB_EP3_TX_FIFO_CNT        USB_EP3_TX_FIFO_CNT
#define USB_EP3_TX_FIFO_CNT_POS    (0U)
#define USB_EP3_TX_FIFO_CNT_LEN    (7U)
#define USB_EP3_TX_FIFO_CNT_MSK    (((1U << USB_EP3_TX_FIFO_CNT_LEN) - 1) << USB_EP3_TX_FIFO_CNT_POS)
#define USB_EP3_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP3_TX_FIFO_CNT_LEN) - 1) << USB_EP3_TX_FIFO_CNT_POS))
#define USB_EP3_TX_FIFO_EMPTY      USB_EP3_TX_FIFO_EMPTY
#define USB_EP3_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP3_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP3_TX_FIFO_EMPTY_MSK  (((1U << USB_EP3_TX_FIFO_EMPTY_LEN) - 1) << USB_EP3_TX_FIFO_EMPTY_POS)
#define USB_EP3_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP3_TX_FIFO_EMPTY_LEN) - 1) << USB_EP3_TX_FIFO_EMPTY_POS))
#define USB_EP3_TX_FIFO_FULL       USB_EP3_TX_FIFO_FULL
#define USB_EP3_TX_FIFO_FULL_POS   (15U)
#define USB_EP3_TX_FIFO_FULL_LEN   (1U)
#define USB_EP3_TX_FIFO_FULL_MSK   (((1U << USB_EP3_TX_FIFO_FULL_LEN) - 1) << USB_EP3_TX_FIFO_FULL_POS)
#define USB_EP3_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP3_TX_FIFO_FULL_LEN) - 1) << USB_EP3_TX_FIFO_FULL_POS))
#define USB_EP3_RX_FIFO_CNT        USB_EP3_RX_FIFO_CNT
#define USB_EP3_RX_FIFO_CNT_POS    (16U)
#define USB_EP3_RX_FIFO_CNT_LEN    (7U)
#define USB_EP3_RX_FIFO_CNT_MSK    (((1U << USB_EP3_RX_FIFO_CNT_LEN) - 1) << USB_EP3_RX_FIFO_CNT_POS)
#define USB_EP3_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP3_RX_FIFO_CNT_LEN) - 1) << USB_EP3_RX_FIFO_CNT_POS))
#define USB_EP3_RX_FIFO_EMPTY      USB_EP3_RX_FIFO_EMPTY
#define USB_EP3_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP3_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP3_RX_FIFO_EMPTY_MSK  (((1U << USB_EP3_RX_FIFO_EMPTY_LEN) - 1) << USB_EP3_RX_FIFO_EMPTY_POS)
#define USB_EP3_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP3_RX_FIFO_EMPTY_LEN) - 1) << USB_EP3_RX_FIFO_EMPTY_POS))
#define USB_EP3_RX_FIFO_FULL       USB_EP3_RX_FIFO_FULL
#define USB_EP3_RX_FIFO_FULL_POS   (31U)
#define USB_EP3_RX_FIFO_FULL_LEN   (1U)
#define USB_EP3_RX_FIFO_FULL_MSK   (((1U << USB_EP3_RX_FIFO_FULL_LEN) - 1) << USB_EP3_RX_FIFO_FULL_POS)
#define USB_EP3_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP3_RX_FIFO_FULL_LEN) - 1) << USB_EP3_RX_FIFO_FULL_POS))

/* 0x138 : ep3_tx_fifo_wdata */
#define USB_EP3_TX_FIFO_WDATA_OFFSET (0x138)
#define USB_EP3_TX_FIFO_WDATA        USB_EP3_TX_FIFO_WDATA
#define USB_EP3_TX_FIFO_WDATA_POS    (0U)
#define USB_EP3_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP3_TX_FIFO_WDATA_MSK    (((1U << USB_EP3_TX_FIFO_WDATA_LEN) - 1) << USB_EP3_TX_FIFO_WDATA_POS)
#define USB_EP3_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP3_TX_FIFO_WDATA_LEN) - 1) << USB_EP3_TX_FIFO_WDATA_POS))

/* 0x13C : ep3_rx_fifo_rdata */
#define USB_EP3_RX_FIFO_RDATA_OFFSET (0x13C)
#define USB_EP3_RX_FIFO_RDATA        USB_EP3_RX_FIFO_RDATA
#define USB_EP3_RX_FIFO_RDATA_POS    (0U)
#define USB_EP3_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP3_RX_FIFO_RDATA_MSK    (((1U << USB_EP3_RX_FIFO_RDATA_LEN) - 1) << USB_EP3_RX_FIFO_RDATA_POS)
#define USB_EP3_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP3_RX_FIFO_RDATA_LEN) - 1) << USB_EP3_RX_FIFO_RDATA_POS))

/* 0x140 : ep4_fifo_config */
#define USB_EP4_FIFO_CONFIG_OFFSET     (0x140)
#define USB_EP4_DMA_TX_EN              USB_EP4_DMA_TX_EN
#define USB_EP4_DMA_TX_EN_POS          (0U)
#define USB_EP4_DMA_TX_EN_LEN          (1U)
#define USB_EP4_DMA_TX_EN_MSK          (((1U << USB_EP4_DMA_TX_EN_LEN) - 1) << USB_EP4_DMA_TX_EN_POS)
#define USB_EP4_DMA_TX_EN_UMSK         (~(((1U << USB_EP4_DMA_TX_EN_LEN) - 1) << USB_EP4_DMA_TX_EN_POS))
#define USB_EP4_DMA_RX_EN              USB_EP4_DMA_RX_EN
#define USB_EP4_DMA_RX_EN_POS          (1U)
#define USB_EP4_DMA_RX_EN_LEN          (1U)
#define USB_EP4_DMA_RX_EN_MSK          (((1U << USB_EP4_DMA_RX_EN_LEN) - 1) << USB_EP4_DMA_RX_EN_POS)
#define USB_EP4_DMA_RX_EN_UMSK         (~(((1U << USB_EP4_DMA_RX_EN_LEN) - 1) << USB_EP4_DMA_RX_EN_POS))
#define USB_EP4_TX_FIFO_CLR            USB_EP4_TX_FIFO_CLR
#define USB_EP4_TX_FIFO_CLR_POS        (2U)
#define USB_EP4_TX_FIFO_CLR_LEN        (1U)
#define USB_EP4_TX_FIFO_CLR_MSK        (((1U << USB_EP4_TX_FIFO_CLR_LEN) - 1) << USB_EP4_TX_FIFO_CLR_POS)
#define USB_EP4_TX_FIFO_CLR_UMSK       (~(((1U << USB_EP4_TX_FIFO_CLR_LEN) - 1) << USB_EP4_TX_FIFO_CLR_POS))
#define USB_EP4_RX_FIFO_CLR            USB_EP4_RX_FIFO_CLR
#define USB_EP4_RX_FIFO_CLR_POS        (3U)
#define USB_EP4_RX_FIFO_CLR_LEN        (1U)
#define USB_EP4_RX_FIFO_CLR_MSK        (((1U << USB_EP4_RX_FIFO_CLR_LEN) - 1) << USB_EP4_RX_FIFO_CLR_POS)
#define USB_EP4_RX_FIFO_CLR_UMSK       (~(((1U << USB_EP4_RX_FIFO_CLR_LEN) - 1) << USB_EP4_RX_FIFO_CLR_POS))
#define USB_EP4_TX_FIFO_OVERFLOW       USB_EP4_TX_FIFO_OVERFLOW
#define USB_EP4_TX_FIFO_OVERFLOW_POS   (4U)
#define USB_EP4_TX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP4_TX_FIFO_OVERFLOW_MSK   (((1U << USB_EP4_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP4_TX_FIFO_OVERFLOW_POS)
#define USB_EP4_TX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP4_TX_FIFO_OVERFLOW_LEN) - 1) << USB_EP4_TX_FIFO_OVERFLOW_POS))
#define USB_EP4_TX_FIFO_UNDERFLOW      USB_EP4_TX_FIFO_UNDERFLOW
#define USB_EP4_TX_FIFO_UNDERFLOW_POS  (5U)
#define USB_EP4_TX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP4_TX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP4_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP4_TX_FIFO_UNDERFLOW_POS)
#define USB_EP4_TX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP4_TX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP4_TX_FIFO_UNDERFLOW_POS))
#define USB_EP4_RX_FIFO_OVERFLOW       USB_EP4_RX_FIFO_OVERFLOW
#define USB_EP4_RX_FIFO_OVERFLOW_POS   (6U)
#define USB_EP4_RX_FIFO_OVERFLOW_LEN   (1U)
#define USB_EP4_RX_FIFO_OVERFLOW_MSK   (((1U << USB_EP4_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP4_RX_FIFO_OVERFLOW_POS)
#define USB_EP4_RX_FIFO_OVERFLOW_UMSK  (~(((1U << USB_EP4_RX_FIFO_OVERFLOW_LEN) - 1) << USB_EP4_RX_FIFO_OVERFLOW_POS))
#define USB_EP4_RX_FIFO_UNDERFLOW      USB_EP4_RX_FIFO_UNDERFLOW
#define USB_EP4_RX_FIFO_UNDERFLOW_POS  (7U)
#define USB_EP4_RX_FIFO_UNDERFLOW_LEN  (1U)
#define USB_EP4_RX_FIFO_UNDERFLOW_MSK  (((1U << USB_EP4_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP4_RX_FIFO_UNDERFLOW_POS)
#define USB_EP4_RX_FIFO_UNDERFLOW_UMSK (~(((1U << USB_EP4_RX_FIFO_UNDERFLOW_LEN) - 1) << USB_EP4_RX_FIFO_UNDERFLOW_POS))

/* 0x144 : ep4_fifo_status */
#define USB_EP4_FIFO_STATUS_OFFSET (0x144)
#define USB_EP4_TX_FIFO_CNT        USB_EP4_TX_FIFO_CNT
#define USB_EP4_TX_FIFO_CNT_POS    (0U)
#define USB_EP4_TX_FIFO_CNT_LEN    (7U)
#define USB_EP4_TX_FIFO_CNT_MSK    (((1U << USB_EP4_TX_FIFO_CNT_LEN) - 1) << USB_EP4_TX_FIFO_CNT_POS)
#define USB_EP4_TX_FIFO_CNT_UMSK   (~(((1U << USB_EP4_TX_FIFO_CNT_LEN) - 1) << USB_EP4_TX_FIFO_CNT_POS))
#define USB_EP4_TX_FIFO_EMPTY      USB_EP4_TX_FIFO_EMPTY
#define USB_EP4_TX_FIFO_EMPTY_POS  (14U)
#define USB_EP4_TX_FIFO_EMPTY_LEN  (1U)
#define USB_EP4_TX_FIFO_EMPTY_MSK  (((1U << USB_EP4_TX_FIFO_EMPTY_LEN) - 1) << USB_EP4_TX_FIFO_EMPTY_POS)
#define USB_EP4_TX_FIFO_EMPTY_UMSK (~(((1U << USB_EP4_TX_FIFO_EMPTY_LEN) - 1) << USB_EP4_TX_FIFO_EMPTY_POS))
#define USB_EP4_TX_FIFO_FULL       USB_EP4_TX_FIFO_FULL
#define USB_EP4_TX_FIFO_FULL_POS   (15U)
#define USB_EP4_TX_FIFO_FULL_LEN   (1U)
#define USB_EP4_TX_FIFO_FULL_MSK   (((1U << USB_EP4_TX_FIFO_FULL_LEN) - 1) << USB_EP4_TX_FIFO_FULL_POS)
#define USB_EP4_TX_FIFO_FULL_UMSK  (~(((1U << USB_EP4_TX_FIFO_FULL_LEN) - 1) << USB_EP4_TX_FIFO_FULL_POS))
#define USB_EP4_RX_FIFO_CNT        USB_EP4_RX_FIFO_CNT
#define USB_EP4_RX_FIFO_CNT_POS    (16U)
#define USB_EP4_RX_FIFO_CNT_LEN    (7U)
#define USB_EP4_RX_FIFO_CNT_MSK    (((1U << USB_EP4_RX_FIFO_CNT_LEN) - 1) << USB_EP4_RX_FIFO_CNT_POS)
#define USB_EP4_RX_FIFO_CNT_UMSK   (~(((1U << USB_EP4_RX_FIFO_CNT_LEN) - 1) << USB_EP4_RX_FIFO_CNT_POS))
#define USB_EP4_RX_FIFO_EMPTY      USB_EP4_RX_FIFO_EMPTY
#define USB_EP4_RX_FIFO_EMPTY_POS  (30U)
#define USB_EP4_RX_FIFO_EMPTY_LEN  (1U)
#define USB_EP4_RX_FIFO_EMPTY_MSK  (((1U << USB_EP4_RX_FIFO_EMPTY_LEN) - 1) << USB_EP4_RX_FIFO_EMPTY_POS)
#define USB_EP4_RX_FIFO_EMPTY_UMSK (~(((1U << USB_EP4_RX_FIFO_EMPTY_LEN) - 1) << USB_EP4_RX_FIFO_EMPTY_POS))
#define USB_EP4_RX_FIFO_FULL       USB_EP4_RX_FIFO_FULL
#define USB_EP4_RX_FIFO_FULL_POS   (31U)
#define USB_EP4_RX_FIFO_FULL_LEN   (1U)
#define USB_EP4_RX_FIFO_FULL_MSK   (((1U << USB_EP4_RX_FIFO_FULL_LEN) - 1) << USB_EP4_RX_FIFO_FULL_POS)
#define USB_EP4_RX_FIFO_FULL_UMSK  (~(((1U << USB_EP4_RX_FIFO_FULL_LEN) - 1) << USB_EP4_RX_FIFO_FULL_POS))

/* 0x148 : ep4_tx_fifo_wdata */
#define USB_EP4_TX_FIFO_WDATA_OFFSET (0x148)
#define USB_EP4_TX_FIFO_WDATA        USB_EP4_TX_FIFO_WDATA
#define USB_EP4_TX_FIFO_WDATA_POS    (0U)
#define USB_EP4_TX_FIFO_WDATA_LEN    (8U)
#define USB_EP4_TX_FIFO_WDATA_MSK    (((1U << USB_EP4_TX_FIFO_WDATA_LEN) - 1) << USB_EP4_TX_FIFO_WDATA_POS)
#define USB_EP4_TX_FIFO_WDATA_UMSK   (~(((1U << USB_EP4_TX_FIFO_WDATA_LEN) - 1) << USB_EP4_TX_FIFO_WDATA_POS))

/* 0x14C : ep4_rx_fifo_rdata */
#define USB_EP4_RX_FIFO_RDATA_OFFSET (0x14C)
#define USB_EP4_RX_FIFO_RDATA        USB_EP4_RX_FIFO_RDATA
#define USB_EP4_RX_FIFO_RDATA_POS    (0U)
#define USB_EP4_RX_FIFO_RDATA_LEN    (8U)
#define USB_EP4_RX_FIFO_RDATA_MSK    (((1U << USB_EP4_RX_FIFO_RDATA_LEN) - 1) << USB_EP4_RX_FIFO_RDATA_POS)
#define USB_EP4_RX_FIFO_RDATA_UMSK   (~(((1U << USB_EP4_RX_FIFO_RDATA_LEN) - 1) << USB_EP4_RX_FIFO_RDATA_POS))

