bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x10 : usb_setup_data_0 */
    union {
        struct
        {
            uint32_t sts_setup_data_b0 : 8; /* [ 7: 0],          r,        0x0 */
            uint32_t sts_setup_data_b1 : 8; /* [15: 8],          r,        0x0 */
            uint32_t sts_setup_data_b2 : 8; /* [23:16],          r,        0x0 */
            uint32_t sts_setup_data_b3 : 8; /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_setup_data_0;

    /* 0x14 : usb_setup_data_1 */
    union {
        struct
        {
            uint32_t sts_setup_data_b4 : 8; /* [ 7: 0],          r,        0x0 */
            uint32_t sts_setup_data_b5 : 8; /* [15: 8],          r,        0x0 */
            uint32_t sts_setup_data_b6 : 8; /* [23:16],          r,        0x0 */
            uint32_t sts_setup_data_b7 : 8; /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_setup_data_1;

    /* 0x18 : usb_frame_no */
    union {
        struct
        {
            uint32_t sts_frame_no   : 11; /* [10: 0],          r,        0x0 */
            uint32_t reserved_11    : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t sts_pid        : 4;  /* [15:12],          r,        0x0 */
            uint32_t sts_ep_no      : 4;  /* [19:16],          r,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_frame_no;

    /* 0x1C : usb_error */
    union {
        struct
        {
            uint32_t utmi_rx_err   : 1;  /* [    0],          r,        0x0 */
            uint32_t xfer_to_err   : 1;  /* [    1],          r,        0x0 */
            uint32_t ivld_ep_err   : 1;  /* [    2],          r,        0x0 */
            uint32_t pid_seq_err   : 1;  /* [    3],          r,        0x0 */
            uint32_t pid_cks_err   : 1;  /* [    4],          r,        0x0 */
            uint32_t crc5_err      : 1;  /* [    5],          r,        0x0 */
            uint32_t crc16_err     : 1;  /* [    6],          r,        0x0 */
            uint32_t reserved_7_31 : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_error;

    /* 0x20 : USB interrupt enable */
    union {
        struct
        {
            uint32_t cr_sof_en            : 1; /* [    0],        r/w,        0x1 */
            uint32_t cr_usb_reset_en      : 1; /* [    1],        r/w,        0x1 */
            uint32_t cr_vbus_tgl_en       : 1; /* [    2],        r/w,        0x1 */
            uint32_t cr_get_dct_cmd_en    : 1; /* [    3],        r/w,        0x1 */
            uint32_t cr_ep0_setup_cmd_en  : 1; /* [    4],        r/w,        0x1 */
            uint32_t cr_ep0_setup_done_en : 1; /* [    5],        r/w,        0x1 */
            uint32_t cr_ep0_in_cmd_en     : 1; /* [    6],        r/w,        0x1 */
            uint32_t cr_ep0_in_done_en    : 1; /* [    7],        r/w,        0x1 */
            uint32_t cr_ep0_out_cmd_en    : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_ep0_out_done_en   : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_ep1_cmd_en        : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_ep1_done_en       : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_ep2_cmd_en        : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_ep2_done_en       : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_ep3_cmd_en        : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_ep3_done_en       : 1; /* [   15],        r/w,        0x1 */
            uint32_t cr_ep4_cmd_en        : 1; /* [   16],        r/w,        0x1 */
            uint32_t cr_ep4_done_en       : 1; /* [   17],        r/w,        0x1 */
            uint32_t cr_ep5_cmd_en        : 1; /* [   18],        r/w,        0x1 */
            uint32_t cr_ep5_done_en       : 1; /* [   19],        r/w,        0x1 */
            uint32_t cr_ep6_cmd_en        : 1; /* [   20],        r/w,        0x1 */
            uint32_t cr_ep6_done_en       : 1; /* [   21],        r/w,        0x1 */
            uint32_t cr_ep7_cmd_en        : 1; /* [   22],        r/w,        0x1 */
            uint32_t cr_ep7_done_en       : 1; /* [   23],        r/w,        0x1 */
            uint32_t rsvd_26_24           : 3; /* [26:24],       rsvd,        0x0 */
            uint32_t cr_usb_rend_en       : 1; /* [   27],        r/w,        0x0 */
            uint32_t cr_lpm_wkup_en       : 1; /* [   28],        r/w,        0x0 */
            uint32_t cr_lpm_pkt_en        : 1; /* [   29],        r/w,        0x0 */
            uint32_t cr_sof_3ms_en        : 1; /* [   30],        r/w,        0x0 */
            uint32_t cr_usb_err_en        : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } usb_int_en;

    /* 0x24 : USB interrupt status */
    union {
        struct
        {
            uint32_t sof_int            : 1; /* [    0],          r,        0x0 */
            uint32_t usb_reset_int      : 1; /* [    1],          r,        0x0 */
            uint32_t vbus_tgl_int       : 1; /* [    2],          r,        0x0 */
            uint32_t get_dct_cmd_int    : 1; /* [    3],          r,        0x0 */
            uint32_t ep0_setup_cmd_int  : 1; /* [    4],          r,        0x0 */
            uint32_t ep0_setup_done_int : 1; /* [    5],          r,        0x0 */
            uint32_t ep0_in_cmd_int     : 1; /* [    6],          r,        0x0 */
            uint32_t ep0_in_done_int    : 1; /* [    7],          r,        0x0 */
            uint32_t ep0_out_cmd_int    : 1; /* [    8],          r,        0x0 */
            uint32_t ep0_out_done_int   : 1; /* [    9],          r,        0x0 */
            uint32_t ep1_cmd_int        : 1; /* [   10],          r,        0x0 */
            uint32_t ep1_done_int       : 1; /* [   11],          r,        0x0 */
            uint32_t ep2_cmd_int        : 1; /* [   12],          r,        0x0 */
            uint32_t ep2_done_int       : 1; /* [   13],          r,        0x0 */
            uint32_t ep3_cmd_int        : 1; /* [   14],          r,        0x0 */
            uint32_t ep3_done_int       : 1; /* [   15],          r,        0x0 */
            uint32_t ep4_cmd_int        : 1; /* [   16],          r,        0x0 */
            uint32_t ep4_done_int       : 1; /* [   17],          r,        0x0 */
            uint32_t ep5_cmd_int        : 1; /* [   18],          r,        0x0 */
            uint32_t ep5_done_int       : 1; /* [   19],          r,        0x0 */
            uint32_t ep6_cmd_int        : 1; /* [   20],          r,        0x0 */
            uint32_t ep6_done_int       : 1; /* [   21],          r,        0x0 */
            uint32_t ep7_cmd_int        : 1; /* [   22],          r,        0x0 */
            uint32_t ep7_done_int       : 1; /* [   23],          r,        0x0 */
            uint32_t rsvd_26_24         : 3; /* [26:24],       rsvd,        0x0 */
            uint32_t usb_rend_int       : 1; /* [   27],          r,        0x0 */
            uint32_t lpm_wkup_int       : 1; /* [   28],          r,        0x0 */
            uint32_t lpm_pkt_int        : 1; /* [   29],          r,        0x0 */
            uint32_t sof_3ms_int        : 1; /* [   30],          r,        0x0 */
            uint32_t usb_err_int        : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } usb_int_sts;

    /* 0x28 : USB interrupt mask */
    union {
        struct
        {
            uint32_t cr_sof_mask            : 1; /* [    0],        r/w,        0x1 */
            uint32_t cr_usb_reset_mask      : 1; /* [    1],        r/w,        0x1 */
            uint32_t cr_vbus_tgl_mask       : 1; /* [    2],        r/w,        0x1 */
            uint32_t cr_get_dct_cmd_mask    : 1; /* [    3],        r/w,        0x1 */
            uint32_t cr_ep0_setup_cmd_mask  : 1; /* [    4],        r/w,        0x1 */
            uint32_t cr_ep0_setup_done_mask : 1; /* [    5],        r/w,        0x1 */
            uint32_t cr_ep0_in_cmd_mask     : 1; /* [    6],        r/w,        0x1 */
            uint32_t cr_ep0_in_done_mask    : 1; /* [    7],        r/w,        0x1 */
            uint32_t cr_ep0_out_cmd_mask    : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_ep0_out_done_mask   : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_ep1_cmd_mask        : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_ep1_done_mask       : 1; /* [   11],        r/w,        0x1 */
            uint32_t cr_ep2_cmd_mask        : 1; /* [   12],        r/w,        0x1 */
            uint32_t cr_ep2_done_mask       : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_ep3_cmd_mask        : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_ep3_done_mask       : 1; /* [   15],        r/w,        0x1 */
            uint32_t cr_ep4_cmd_mask        : 1; /* [   16],        r/w,        0x1 */
            uint32_t cr_ep4_done_mask       : 1; /* [   17],        r/w,        0x1 */
            uint32_t cr_ep5_cmd_mask        : 1; /* [   18],        r/w,        0x1 */
            uint32_t cr_ep5_done_mask       : 1; /* [   19],        r/w,        0x1 */
            uint32_t cr_ep6_cmd_mask        : 1; /* [   20],        r/w,        0x1 */
            uint32_t cr_ep6_done_mask       : 1; /* [   21],        r/w,        0x1 */
            uint32_t cr_ep7_cmd_mask        : 1; /* [   22],        r/w,        0x1 */
            uint32_t cr_ep7_done_mask       : 1; /* [   23],        r/w,        0x1 */
            uint32_t rsvd_26_24             : 3; /* [26:24],       rsvd,        0x0 */
            uint32_t cr_usb_rend_mask       : 1; /* [   27],        r/w,        0x1 */
            uint32_t cr_lpm_wkup_mask       : 1; /* [   28],        r/w,        0x1 */
            uint32_t cr_lpm_pkt_mask        : 1; /* [   29],        r/w,        0x1 */
            uint32_t cr_sof_3ms_mask        : 1; /* [   30],        r/w,        0x1 */
            uint32_t cr_usb_err_mask        : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } usb_int_mask;

