bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/usb_reg.h
    /* 0x5c  reserved */
    uint8_t RESERVED0x5c[164];

    /* 0x100 : ep0_fifo_config */
    union {
        struct
        {
            uint32_t ep0_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep0_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep0_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep0_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep0_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep0_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep0_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep0_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep0_fifo_config;

    /* 0x104 : ep0_fifo_status */
    union {
        struct
        {
            uint32_t ep0_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep0_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep0_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep0_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep0_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep0_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep0_fifo_status;

    /* 0x108 : ep0_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep0_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep0_tx_fifo_wdata;

    /* 0x10C : ep0_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep0_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep0_rx_fifo_rdata;

    /* 0x110 : ep1_fifo_config */
    union {
        struct
        {
            uint32_t ep1_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep1_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep1_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep1_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep1_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep1_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep1_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep1_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep1_fifo_config;

    /* 0x114 : ep1_fifo_status */
    union {
        struct
        {
            uint32_t ep1_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep1_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep1_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep1_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep1_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep1_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep1_fifo_status;

    /* 0x118 : ep1_tx_fifo_wdata */
    union {
        struct
        {
            uint32_t ep1_tx_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep1_tx_fifo_wdata;

    /* 0x11C : ep1_rx_fifo_rdata */
    union {
        struct
        {
            uint32_t ep1_rx_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep1_rx_fifo_rdata;

    /* 0x120 : ep2_fifo_config */
    union {
        struct
        {
            uint32_t ep2_dma_tx_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ep2_dma_rx_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ep2_tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t ep2_rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t ep2_tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t ep2_tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t ep2_rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t ep2_rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31         : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ep2_fifo_config;

    /* 0x124 : ep2_fifo_status */
    union {
        struct
        {
            uint32_t ep2_tx_fifo_cnt   : 7; /* [ 6: 0],          r,       0x40 */
            uint32_t reserved_7_13     : 7; /* [13: 7],       rsvd,        0x0 */
            uint32_t ep2_tx_fifo_empty : 1; /* [   14],          r,        0x1 */
            uint32_t ep2_tx_fifo_full  : 1; /* [   15],          r,        0x0 */
            uint32_t ep2_rx_fifo_cnt   : 7; /* [22:16],          r,        0x0 */
            uint32_t reserved_23_29    : 7; /* [29:23],       rsvd,        0x0 */
            uint32_t ep2_rx_fifo_empty : 1; /* [   30],          r,        0x1 */
            uint32_t ep2_rx_fifo_full  : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } ep2_fifo_status;

